; domain
(define (domain parking)
 (:requirements :strips :typing :action-costs)
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )

(:functions (total-cost) - number)

	(:action move-curb-to-curb
		:parameters (?car - car ?curbsrc ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(at-curb-num ?car ?curbsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(curb-clear ?curbsrc)
			(at-curb-num ?car ?curbdest)
			(not (at-curb-num ?car ?curbsrc))
                        (increase (total-cost) 1)
		)
	)

	(:action move-curb-to-car
		:parameters (?car - car ?curbsrc - curb ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(at-curb-num ?car ?curbsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(curb-clear ?curbsrc)
			(behind-car ?car ?cardest)
			(not (at-curb-num ?car ?curbsrc))
			(not (at-curb ?car))
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-curb
		:parameters (?car - car ?carsrc - car ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(behind-car ?car ?carsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(car-clear ?carsrc)
			(at-curb-num ?car ?curbdest)
			(not (behind-car ?car ?carsrc))
			(at-curb ?car)
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-car
		:parameters (?car - car ?carsrc - car ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(behind-car ?car ?carsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(car-clear ?carsrc)
			(behind-car ?car ?cardest)
			(not (behind-car ?car ?carsrc))
                        (increase (total-cost) 1)
		)
	)
)

; problem
(define   (problem parking)
  (:domain parking)
  (:objects
     car_0  car_1  car_2  car_3 - car
     curb_0 curb_1 curb_2 - curb
  )
  (:init
    (at-curb car_1)
    (at-curb-num car_1 curb_0)
    (behind-car car_2 car_1)
    (car-clear car_2)
    (at-curb car_3)
    (at-curb-num car_3 curb_1)
    (behind-car car_0 car_3)
    (car-clear car_0)
    (curb-clear curb_2)
  )
  (:goal
    (and
      (at-curb-num car_0 curb_0)
      (behind-car car_3 car_0)
      (at-curb-num car_1 curb_1)
      (at-curb-num car_2 curb_2)
    )
  )
)
; =========== INIT =========== 
;  curb_0: car_1 car_2 
;  curb_1: car_3 car_0 
;  curb_2: 
; ========== /INIT =========== 

; =========== GOAL =========== 
;  curb_0: car_0 car_3 
;  curb_1: car_1 
;  curb_2: car_2 
; =========== /GOAL ===========

; plan
1. (move-car-to-curb car_2 car_1 curb_2)
   deleted: (curb-clear curb_2) (behind-car car_2 car_1)
   added: (car-clear car_1) (at-curb-num car_2 curb_2) (at-curb car_2)
   goals met: 1 of 4
2. (move-curb-to-car car_1 curb_0 car_2)
   deleted: (car-clear car_2) (at-curb-num car_1 curb_0) (at-curb car_1)
   added: (curb-clear curb_0) (behind-car car_1 car_2)
   goals met: 1 of 4
3. (move-car-to-curb car_0 car_3 curb_0)
   deleted: (curb-clear curb_0) (behind-car car_0 car_3)
   added: (car-clear car_3) (at-curb-num car_0 curb_0) (at-curb car_0)
   goals met: 2 of 4
4. (move-curb-to-car car_3 curb_1 car_0)
   deleted: (car-clear car_0) (at-curb-num car_3 curb_1) (at-curb car_3)
   added: (curb-clear curb_1) (behind-car car_3 car_0)
   goals met: 3 of 4
5. (move-car-to-curb car_1 car_2 curb_1)
   deleted: (curb-clear curb_1) (behind-car car_1 car_2)
   added: (car-clear car_2) (at-curb-num car_1 curb_1) (at-curb car_1)
   goals met: 4 of 4
